1.Create a data frame with 4 columns 4 rows

In [4]:
import pandas as pd
m=([[1,2,3,4],[5,6,7,8],[9,5,3,6],[5,4,1,2]])
m1=pd.DataFrame(m,index=['l','c','g','d'],columns=['m','n','o','p'])
print(m1)

   m  n  o  p
l  1  2  3  4
c  5  6  7  8
g  9  5  3  6
d  5  4  1  2

2.print all Columns form your data frame

In [5]:
m1.columns

Index(['m', 'n', 'o', 'p'], dtype='object')

3.print all rows from your data frame

In [6]:
m1.loc[["l","c","g","d"],:]

   m  n  o  p
l  1  2  3  4
c  5  6  7  8
g  9  5  3  6
d  5  4  1  2

4.print Second column in your data frame

In [7]:
m1[["o"]]

   o
l  3
c  7
g  3
d  1

5.print last 2 columns from your data Frame

In [8]:
m1.loc[:,"o":]

   o  p
l  3  4
c  7  8
g  3  6
d  1  2

6.print fourth row from your data Frame

In [9]:
m1.loc["d"]

m    5
n    4
o    1
p    2
Name: d, dtype: int64

7.print first 2 Rows from your data Frame

In [10]:
m1.loc[["l","c"],:]

   m  n  o  p
l  1  2  3  4
c  5  6  7  8

8.print all rows and first 2 columns from your data Frame

In [11]:
m1.loc[:,:"n"]

   m  n
l  1  2
c  5  6
g  9  5
d  5  4

9.Delete any row from your data Frame

In [12]:
m1.drop("g")

   m  n  o  p
l  1  2  3  4
c  5  6  7  8
d  5  4  1  2

10.Delete any column from your data Frame

In [13]:
m1.pop("p")

l    4
c    8
g    6
d    2
Name: p, dtype: int64

11.Add a column to a Data Frame

In [14]:
new=[9,7,6,5]
m1['x']=new
print(pd.DataFrame(m1))

   m  n  o  x
l  1  2  3  9
c  5  6  7  7
g  9  5  3  6
d  5  4  1  5

12.Add a Row to Data Frame

In [15]:
new={"m":1,"n":2,"o":3,"x":4}
m=pd.DataFrame(new,index=["i"])
m1=pd.concat([m,m1])
m1

   m  n  o  x
i  1  2  3  4
l  1  2  3  9
c  5  6  7  7
g  9  5  3  6
d  5  4  1  5

13.Iterate all Columns in your Data Frame and print result

In [16]:
for i in iter(m1):
    print(i)

m
n
o
x

14.Iterate the 3rd column values of your Data frame and print result.

In [20]:
for i in m1():
    print(i)

NameError: name 'o' is not defined

15.Iterate all Rows in your Data Frame and print result.

In [ ]:
for i in m1.iterrows():
    print(i)

16.Read income.csv file and print as Data Frame

In [ ]:
a="income.csv"
m1=pd.read_csv(a)
m1

17.Get 2006 column info from your data Frame by using drop

In [ ]:
m1.drop(columns=["2006"])